In [1]:
import pandas as pd
import numpy as np

In [2]:
data = {"state": ["Ohio", "Ohio", "Ohio", "Nevada", "Nevada", "Nevada"],
        "year": [2000, 2001, 2002, 2001, 2002, 2003],
        "pop": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [3]:
pd.Series(data)

state    [Ohio, Ohio, Ohio, Nevada, Nevada, Nevada]
year           [2000, 2001, 2002, 2001, 2002, 2003]
pop                  [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]
dtype: object

In [5]:
frame = pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [9]:
frame.head() # 최상단 5개
frame.tail() # 최하단 5개

    state  year  pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [10]:
frame.head(10) # 최상단 10개

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [16]:
pd.DataFrame(data, columns=['year','state', 'pop']) # 순서변경

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [17]:
frame2 = pd.DataFrame(data, columns=['year','state', 'pop', 'debt'])
frame2

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

In [18]:
frame2.index # range(6)

RangeIndex(start=0, stop=6, step=1)

In [19]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [26]:
# 하나의 열 출력(=시리즈 데이터 출력)
frame2['state']
frame2.state # 얘가 쓰기는 쉬움

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [31]:
frame2.iloc[2]

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: 2, dtype: object

In [32]:
frame2.loc[2]

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: 2, dtype: object

In [33]:
import numpy as np

In [35]:
frame2['debt'] = np.arange(6.)
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   0.0
1  2001    Ohio  1.7   1.0
2  2002    Ohio  3.6   2.0
3  2001  Nevada  2.4   3.0
4  2002  Nevada  2.9   4.0
5  2003  Nevada  3.2   5.0

In [36]:
val = pd.Series([1.2,1.5,1.7], index=['two','three','four'])
val

two      1.2
three    1.5
four     1.7
dtype: float64

In [37]:
frame2['debt'] = val
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   NaN
1  2001    Ohio  1.7   NaN
2  2002    Ohio  3.6   NaN
3  2001  Nevada  2.4   NaN
4  2002  Nevada  2.9   NaN
5  2003  Nevada  3.2   NaN

In [38]:
frame2['eastern'] = [True, True, True, False, False, False]
frame2

   year   state  pop  debt  eastern
0  2000    Ohio  1.5   NaN     True
1  2001    Ohio  1.7   NaN     True
2  2002    Ohio  3.6   NaN     True
3  2001  Nevada  2.4   NaN    False
4  2002  Nevada  2.9   NaN    False
5  2003  Nevada  3.2   NaN    False

In [39]:
frame2['eastern'] = frame2['state'] == 'Ohio'
frame2

   year   state  pop  debt  eastern
0  2000    Ohio  1.5   NaN     True
1  2001    Ohio  1.7   NaN     True
2  2002    Ohio  3.6   NaN     True
3  2001  Nevada  2.4   NaN    False
4  2002  Nevada  2.9   NaN    False
5  2003  Nevada  3.2   NaN    False

In [40]:
populations = {"Ohio": {2000: 1.5, 2001: 1.7, 2002: 3.6},
               "Nevada": {2001: 2.4, 2002: 2.9}}

In [41]:
pd.DataFrame(populations)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [42]:
populations = {"Ohio": {2000: 1.5, 2001: 1.7, 2002: 3.6},
               "Nevada": {2001: 2.4, 2002: 2.9, 2003: 4.0}}
frame3 = pd.DataFrame(populations)
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9
2003   NaN     4.0

In [43]:
frame3.T # 전치행렬

        2000  2001  2002  2003
Ohio     1.5   1.7   3.6   NaN
Nevada   NaN   2.4   2.9   4.0

In [45]:
pd.DataFrame(populations, index=[2001,2002, 2004])

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9
2004   NaN     NaN

In [47]:
# 2000 1.5
# 2001 1.7 이 출력되도록 만들기(3가지 이상 방법)
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9
2003   NaN     4.0

In [48]:
frame3.to_numpy()

array([[1.5, nan],
       [1.7, 2.4],
       [3.6, 2.9],
       [nan, 4. ]])

In [51]:
frame2.to_numpy()

array([[2000, 'Ohio', 1.5, nan, True],
       [2001, 'Ohio', 1.7, nan, True],
       [2002, 'Ohio', 3.6, nan, True],
       [2001, 'Nevada', 2.4, nan, False],
       [2002, 'Nevada', 2.9, nan, False],
       [2003, 'Nevada', 3.2, nan, False]], dtype=object)

In [52]:
obj = pd.Series(np.arange(3), index=['a','b','c'])
obj

a    0
b    1
c    2
dtype: int32

In [53]:
obj.index

Index(['a', 'b', 'c'], dtype='object')

In [55]:
obj.index[:2]

Index(['a', 'b'], dtype='object')

In [56]:
obj2 = pd.Series([1.5,2.5,3.], index=np.arange(1,4))
obj2

1    1.5
2    2.5
3    3.0
dtype: float64

In [58]:
3 in obj2.index # 인덱스에 해당 데이터가 있는가?

True

In [59]:
obj3 = pd.Series(['blue','purple','yellow'], index=[0,2,4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [60]:
obj3.reindex(np.arange(6))

0      blue
1       NaN
2    purple
3       NaN
4    yellow
5       NaN
dtype: object

In [61]:
obj3.reindex(np.arange(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [63]:
frame  = pd.DataFrame(np.arange(9).reshape((3,3)),
                      index=['a','b','c'],
                      columns=['Ohio','Texas','California'])
frame

   Ohio  Texas  California
a     0      1           2
b     3      4           5
c     6      7           8

In [65]:
frame.reindex(index=['a','b','c','d'], method='ffill')

   Ohio  Texas  California
a     0      1           2
b     3      4           5
c     6      7           8
d     6      7           8

In [69]:
states = ['texas','Utah','California']
frame2 = frame.reindex(columns=states)
frame2

   texas  Utah  California
a    NaN   NaN           2
b    NaN   NaN           5
c    NaN   NaN           8

In [77]:
frame2.drop('b').reset_index(drop=True)

   texas  Utah  California
0    NaN   NaN           2
1    NaN   NaN           8

In [79]:
frame2.drop(['a','b'])

   texas  Utah  California
c    NaN   NaN           8

In [81]:
frame2.drop('texas', axis=1)
frame2.drop('texas', axis='columns')

   Utah  California
a   NaN           2
b   NaN           5
c   NaN           8

In [86]:
frame2['Utah'][1] # 권장하지 않는 방법
frame2['Utah'].iloc[1] # 권장하는 방법

nan

In [87]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=["Ohio", "Colorado", "Utah", "New York"],
                    columns=["one", "two", "three", "four"])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [ ]:
# three열 값이 5보다 큰 자료 추출

#           one	two	threefour
# Colorado	4	5	6	7
# Utah	    8	9	10	11
# New York	12	13	14	15

In [100]:
# data에서 5,6을 추출
data.loc['Colorado'][1:3]

two      5
three    6
Name: Colorado, dtype: int32

In [101]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=["a", "c", "d", "e"])
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1], index=["a", "c", "e", "f", "g"])
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [102]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [103]:
s1+s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [104]:
df1 = pd.DataFrame(np.arange(9.).reshape(3,3), columns=list('bcd'), index=["Ohio", "Texas", "Colorado"])
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list("bde"),
                   index=["Utah", "Ohio", "Texas", "Oregon"])
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [105]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [106]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [107]:
df1 = pd.DataFrame({"A": [1, 2]})
df2 = pd.DataFrame({"B": [3, 4]})

In [108]:
df1

   A
0  1
1  2

In [109]:
df2

   B
0  3
1  4

In [110]:
df1 + df2

    A   B
0 NaN NaN
1 NaN NaN

In [115]:
df1.A.iloc[1] = np.nan

df1

     A
0  1.0
1  NaN

In [116]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)), columns=list("abcd"))
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)), columns=list("abcde"))
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [117]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [118]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [121]:
df1.add(df2, fill_value=1)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   5.0
1   9.0  11.0  13.0  15.0  10.0
2  18.0  20.0  22.0  24.0  15.0
3  16.0  17.0  18.0  19.0  20.0

In [123]:
1/df1 # np.inf == inf

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [126]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [127]:
df1.div(2)

     a    b    c    d
0  0.0  0.5  1.0  1.5
1  2.0  2.5  3.0  3.5
2  4.0  4.5  5.0  5.5

In [124]:
df1.rdiv(1) # == 1/df1

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [128]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),
                     columns=list("bde"),
                     index=["Utah", "Ohio", "Texas", "Oregon"])
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [129]:
ser = pd.Series(np.arange(3.), index=list('bde'))
ser

b    0.0
d    1.0
e    2.0
dtype: float64

In [130]:
frame - ser

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [131]:
ser2 = pd.Series(np.arange(3), index=list('bef'))
ser2

b    0
e    1
f    2
dtype: int32

In [132]:
frame - ser2

          b   d     e   f
Utah    0.0 NaN   1.0 NaN
Ohio    3.0 NaN   4.0 NaN
Texas   6.0 NaN   7.0 NaN
Oregon  9.0 NaN  10.0 NaN

In [134]:
frame.sub(ser2)

          b   d     e   f
Utah    0.0 NaN   1.0 NaN
Ohio    3.0 NaN   4.0 NaN
Texas   6.0 NaN   7.0 NaN
Oregon  9.0 NaN  10.0 NaN

In [135]:
frame = pd.DataFrame(np.random.standard_normal((4, 3)),
                     columns=list("bde"),
                     index=["Utah", "Ohio", "Texas", "Oregon"])
frame

               b         d         e
Utah   -1.843472  1.656744  0.342504
Ohio   -1.051407  2.967604  1.244871
Texas   0.250917 -1.038976  0.146494
Oregon  0.572367 -0.786267 -0.056003

In [137]:
np.abs(frame)

               b         d         e
Utah    1.843472  1.656744  0.342504
Ohio    1.051407  2.967604  1.244871
Texas   0.250917  1.038976  0.146494
Oregon  0.572367  0.786267  0.056003

In [142]:
frame.d.max()
frame.d.min()
frame.d.max() - frame.d.min()

4.006580129722156

In [145]:
frame

               b         d         e
Utah   -1.843472  1.656744  0.342504
Ohio   -1.051407  2.967604  1.244871
Texas   0.250917 -1.038976  0.146494
Oregon  0.572367 -0.786267 -0.056003

In [146]:
0.572367 +1.843472

2.415839

In [147]:
def f1(x):
    return x.max() - x.min()
frame.apply(max)

b    0.572367
d    2.967604
e    1.244871
dtype: float64

In [149]:
pd.DataFrame(frame.apply(f1), columns=['diff']).T

             b        d         e
diff  2.415839  4.00658  1.300873

In [150]:
frame.apply(f1, axis=1)

Utah      3.500215
Ohio      4.019012
Texas     1.289893
Oregon    1.358634
dtype: float64

In [151]:
def f2(x):
    return pd.Series([x.max(), x.min()], index=['max','min'])
frame.apply(f2, axis=0)

            b         d         e
max  0.572367  2.967604  1.244871
min -1.843472 -1.038976 -0.056003

In [153]:
frame

               b         d         e
Utah   -1.843472  1.656744  0.342504
Ohio   -1.051407  2.967604  1.244871
Texas   0.250917 -1.038976  0.146494
Oregon  0.572367 -0.786267 -0.056003

In [152]:
def my_format(x):
    return f'{x:.2f}'
frame['b'].map(my_format)

Utah      -1.84
Ohio      -1.05
Texas      0.25
Oregon     0.57
Name: b, dtype: object

In [ ]:
# pip install seaborn

In [154]:
import seaborn as sns
tips = sns.load_dataset('tips')
tips

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [155]:
tips.tip

0      1.01
1      1.66
2      3.50
3      3.31
4      3.61
       ...
239    5.92
240    2.00
241    2.00
242    1.75
243    3.00
Name: tip, Length: 244, dtype: float64

In [ ]:
import pandas as pd
import numpy as np
import seaborn as sns
tips = sns.load_dataset('tips')

In [156]:
def mm(x):
    return x.max() , x.min()
pd.DataFrame(tips.tip).apply(mm)

    tip
0  10.0
1   1.0

In [158]:
def mm(x):
    if(x.name == 'tip'):
        return x.max() , x.min()
tips.apply(mm)['tip']

(10.0, 1.0)

In [159]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
                     index=["three", "one"],
                     columns=["d", "a", "b", "c"])
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [163]:
frame.sort_index(axis='columns', ascending=True)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [164]:
obj = pd.Series([4,7,-1,2])
obj

0    4
1    7
2   -1
3    2
dtype: int64

In [165]:
obj.sort_values(ascending=False)

1    7
0    4
3    2
2   -1
dtype: int64

In [166]:
obj2 = pd.Series([4, np.nan, 7, np.nan, -2, 3])
obj2

0    4.0
1    NaN
2    7.0
3    NaN
4   -2.0
5    3.0
dtype: float64

In [173]:
obj2.sort_values(ascending=False)
obj2.sort_values(na_position='first') # 기본은 last

1    NaN
3    NaN
4   -2.0
5    3.0
0    4.0
2    7.0
dtype: float64

In [174]:
obj3 = pd.Series([4,  7, -2, 3])
obj3

0    4
1    7
2   -2
3    3
dtype: int64

In [175]:
obj3.rank()

0    3.0
1    4.0
2    1.0
3    2.0
dtype: float64

In [180]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4, 7, 7])
obj

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
7    7
8    7
dtype: int64

In [187]:
obj.rank()
obj.rank(method='first')
obj.rank(ascending=False)

0    2.5
1    9.0
2    2.5
3    5.5
4    7.0
5    8.0
6    5.5
7    2.5
8    2.5
dtype: float64

In [188]:
obj.unique()

array([ 7, -5,  4,  2,  0], dtype=int64)

In [191]:
obj.index.is_unique

True

In [193]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
                   [np.nan, np.nan], [0.75, -1.3]],
                  index=["a", "b", "c", "d"],
                  columns=["one", "two"])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [197]:
df.sum(axis=1).sum()

3.4499999999999993

In [200]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [203]:
df.sum(skipna=False)

one   NaN
two   NaN
dtype: float64

In [207]:
df.mean(axis=1)

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

In [209]:
df.idxmax()
df.idxmin()

one    d
two    b
dtype: object

In [212]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [213]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, a to d
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   one     3 non-null      float64
 1   two     2 non-null      float64
dtypes: float64(2)
memory usage: 268.0+ bytes

In [214]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [219]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [220]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [222]:
df = pd.read_csv('gapminder.tsv', sep='\t')
# seperator 분리기호

In [223]:
df

          country continent  year  lifeExp       pop   gdpPercap
0     Afghanistan      Asia  1952   28.801   8425333  779.445314
1     Afghanistan      Asia  1957   30.332   9240934  820.853030
2     Afghanistan      Asia  1962   31.997  10267083  853.100710
3     Afghanistan      Asia  1967   34.020  11537966  836.197138
4     Afghanistan      Asia  1972   36.088  13079460  739.981106
...           ...       ...   ...      ...       ...         ...
1699     Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700     Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701     Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702     Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703     Zimbabwe    Africa  2007   43.487  12311143  469.709298

[1704 rows x 6 columns]

In [224]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1704 entries, 0 to 1703
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   country    1704 non-null   object
 1   continent  1704 non-null   object
 2   year       1704 non-null   int64
 3   lifeExp    1704 non-null   float64
 4   pop        1704 non-null   int64
 5   gdpPercap  1704 non-null   float64
dtypes: float64(2), int64(2), object(2)
memory usage: 80.0+ KB

In [225]:
df.describe()

             year      lifeExp           pop      gdpPercap
count  1704.00000  1704.000000  1.704000e+03    1704.000000
mean   1979.50000    59.474439  2.960121e+07    7215.327081
std      17.26533    12.917107  1.061579e+08    9857.454543
min    1952.00000    23.599000  6.001100e+04     241.165876
25%    1965.75000    48.198000  2.793664e+06    1202.060309
50%    1979.50000    60.712500  7.023596e+06    3531.846988
75%    1993.25000    70.845500  1.958522e+07    9325.462346
max    2007.00000    82.603000  1.318683e+09  113523.132900

In [226]:
df.head()

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
1  Afghanistan      Asia  1957   30.332   9240934  820.853030
2  Afghanistan      Asia  1962   31.997  10267083  853.100710
3  Afghanistan      Asia  1967   34.020  11537966  836.197138
4  Afghanistan      Asia  1972   36.088  13079460  739.981106

In [227]:
df.tail()

       country continent  year  lifeExp       pop   gdpPercap
1699  Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700  Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701  Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702  Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703  Zimbabwe    Africa  2007   43.487  12311143  469.709298

In [228]:
df[df.country == 'Zimbabwe']

       country continent  year  lifeExp       pop   gdpPercap
1692  Zimbabwe    Africa  1952   48.451   3080907  406.884115
1693  Zimbabwe    Africa  1957   50.469   3646340  518.764268
1694  Zimbabwe    Africa  1962   52.358   4277736  527.272182
1695  Zimbabwe    Africa  1967   53.995   4995432  569.795071
1696  Zimbabwe    Africa  1972   55.635   5861135  799.362176
1697  Zimbabwe    Africa  1977   57.674   6642107  685.587682
1698  Zimbabwe    Africa  1982   60.363   7636524  788.855041
1699  Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700  Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701  Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702  Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703  Zimbabwe    Africa  2007   43.487  12311143  469.709298

In [229]:
df[df.country == 'Japan']

    country continent  year  lifeExp        pop     gdpPercap
792   Japan      Asia  1952   63.030   86459025   3216.956347
793   Japan      Asia  1957   65.500   91563009   4317.694365
794   Japan      Asia  1962   68.730   95831757   6576.649461
795   Japan      Asia  1967   71.430  100825279   9847.788607
796   Japan      Asia  1972   73.420  107188273  14778.786360
797   Japan      Asia  1977   75.380  113872473  16610.377010
798   Japan      Asia  1982   77.110  118454974  19384.105710
799   Japan      Asia  1987   78.670  122091325  22375.941890
800   Japan      Asia  1992   79.360  124329269  26824.895110
801   Japan      Asia  1997   80.690  125956499  28816.584990
802   Japan      Asia  2002   82.000  127065841  28604.591900
803   Japan      Asia  2007   82.603  127467972  31656.068060

In [ ]:
버튼 누르면 색상이 빨간색으로...RGB(255,255,255) -> RGB(255,0,0)

In [ ]:
# 위의 데이터셋을 이용하여, 문제 풀기

# 1. iloc, loc 속성으로 각각 행 데이터 추출
# 2. 열 단위 데이터 추출
# 3. year, pop 데이터만 추출
# 4. country continent year 데이터 추출
# 5. continent year country 데이터 추출
# iloc, loc을 이용하여 자유자재 사용

# ex1)
#          country  lifeExp    gdpPercap
# 0    Afghanistan   28.801   779.445314
# 99    Bangladesh   43.453   721.186086
# 999     Mongolia   51.253  1226.041130

# ex2)
# 출력예시)
#         country  lifeExp    gdpPercap
# 10  Afghanistan   42.129   726.734055
# 11  Afghanistan   43.828   974.580338
# 12      Albania   55.230  1601.056136
# 13      Albania   59.280  1942.284244

In [ ]:
# 행과 열에 라벨을 가지는 5x5 이상의 크기를 가지는 데이터 프레임을 생성
# 10가지 이상의 방법으로 특정한 행과 열을 선택하기
# 데이터셋은 자유롭게 생성(성적, 국가 데이터, 주식, 의료 데이터 등등 다양하게 활용 혹은 생성)